In [1]:
import json
import pandas as pd

In [2]:
def get_column_names(schemas, ds_name, sorting_key='column_position'):
  column_details = schemas[ds_name]
  columns = sorted(column_details, key=lambda col: col[sorting_key])
  return [col['column_name'] for col in columns]

In [3]:
schemas = json.load(open('../../data/retail_db/schemas.json'))

In [4]:
order_columns = get_column_names(schemas, 'orders')
order_columns

['order_id', 'order_date', 'order_customer_id', 'order_status']

In [5]:
orders = pd.read_csv('../../data/retail_db/orders/part-00000', names=order_columns)

In [6]:
orders[:5]

   order_id             order_date  order_customer_id     order_status
0         1  2013-07-25 00:00:00.0              11599           CLOSED
1         2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2         3  2013-07-25 00:00:00.0              12111         COMPLETE
3         4  2013-07-25 00:00:00.0               8827           CLOSED
4         5  2013-07-25 00:00:00.0              11318         COMPLETE

In [7]:
customer_columns = get_column_names(schemas, 'customers')

In [8]:
customers = pd.read_csv('../../data/retail_db/customers/part-00000', names=customer_columns)

In [9]:
customers[:5]

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,725
3,4,Mary,Jones,XXXXXXXXX,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,XXXXXXXXX,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,725

In [10]:
customers = customers.set_index('customer_id')

In [11]:
orders = orders.set_index('order_customer_id')

In [12]:
customer_orders = customers.join(orders, how='inner')

In [13]:
customer_orders.shape

(68883, 11)

In [17]:
customer_orders.reset_index().groupby('customer_id')['customer_id'].agg(order_count='count').reset_index().query('order_count >=10')

       customer_id  order_count
70              71           10
171            172           10
173            174           12
196            197           11
219            221           15
...            ...          ...
12311        12341           10
12317        12347           10
12375        12406           10
12400        12431           16
12401        12432           10

[699 rows x 2 columns]